#include "General.h"

UI08 S_mS5_Cont = 0;     // 5ms计数
UI08 S_ms10_Cont = 0;    // 10ms计数
UI08 S_mS100_Cont = 0;   // 100ms计数
UI08 S_mS250_Cont = 0;   // 250ms计数
UI08 S_mS500_Cont = 0;   // 500ms计数
UI08 S_S1_Cont = 0;      // 1S计数
UI08 S_Minute_Count = 0; //分钟count

UUI16 G_Time_Bit = {0}; // 1ms时间片

// *****************************************************************************
// 函数名称 : Timer_Init
// 功能说明 : 系统时间定时器初始化
// 入口参数 : 无
// 出口参数 : 无
// 当前版本 : V1.0
// 编写人员 : 许荣乾
// 审核人员 :
// 审核日期 :
// 修改记录 :   V1.0首次发布
// 备注     ：
//
// *****************************************************************************

void Timer_Init(void)
{
  SYS_Tick_Time(); // 0.125mS 定时
}

// *****************************************************************************
// 函数名称 : Prg_mS1
// 功能说明 : 时间片标志志置一
// 入口参数 : 无
// 出口参数 : 无
// 当前版本 : V1.0
// 编写人员 : 许荣乾
// 审核人员 :
// 审核日期 :
// 修改记录 :   V1.0首次发布
// 备注     ： 定时器 每1mS调用一次
//
// *****************************************************************************
static void Prg_mS1(void) //此函数放在中断程序中执行
{
  if (G_Buzz_Time > 0)
  {
    G_Buzz_Time--;
  }

  S_mS5_Cont++;
  if (S_mS5_Cont >= 5)
  {
    S_mS5_Cont = 0;
    _5mS_For_SYS = 1;
  }

  S_ms10_Cont++;
  if (S_ms10_Cont >= 10)
  {
    _10mS_For_SYS = 1;
    S_ms10_Cont = 0;
    S_mS100_Cont++;
    S_mS250_Cont++;
  }

  if (S_mS250_Cont >= 25)
  {
    S_mS250_Cont = 0;
    _250mS_For_SYS = 1;
  }

  if (S_mS100_Cont >= 10)
  {
    _100mS_For_SYS = 1;
    S_mS100_Cont = 0;
    S_mS500_Cont++;
    if (S_mS500_Cont >= 5)
    {
      S_mS500_Cont = 0;
      _500mS_For_SYS = 1;
    }

    S_S1_Cont++;
    if (S_S1_Cont >= 10)
    {
      S_S1_Cont = 0;
      _1S_For_For_SYS = 1;
    }
  }
}

// *****************************************************************************
// 函数名称 : SYS_Tick_IRQ
// 功能说明 : 系统定时器中断调用函数
// 入口参数 : 无
// 出口参数 : 无
// 当前版本 : V1.0
// 编写人员 : 许荣乾
// 审核人员 :
// 审核日期 :
// 修改记录 :   V1.0首次发布
// 备注     ：  每0.125mS中断一次
//
// *****************************************************************************
void SYS_Tick_IRQ(void)
{
  static UI08 s_mS_rj = 0;
  if (G_Buzz_Time > 0)
  {
    if (G_Buzzer_IO_Status == RESET)
    {
      BUZZ_ON;
      G_Buzzer_IO_Status = SET;
    }
    else
    {
      BUZZ_OFF;
      G_Buzzer_IO_Status = RESET;
    }
  }
  else
  {
    BUZZ_OFF;
  }

  Communication_INT_Deal();

  //================   1ms时间片   =====================================
  if (++s_mS_rj >= 8)
  {
    s_mS_rj = 0;
    Prg_mS1();
    Led_Scan();
  }
}

// *****************************************************************************
// 函数名称 : Timer_Deal
// 功能说明 : 大于1秒的时间标志置一
// 入口参数 : 无
// 出口参数 : 无
// 当前版本 : V1.0
// 编写人员 : 许荣乾
// 审核人员 :
// 审核日期 :
// 修改记录 :   V1.0首次发布
// 备注     ：
//
// *****************************************************************************
void Timer_Deal(void) //此函数放在主程序中执行
{
  if (!_1S_For_For_SYS)
  {
    return;
  }

  S_Minute_Count++;
  if (S_Minute_Count >= 60)
  {
    S_Minute_Count = 0;
    _1Minute_For_SYS = 1;
  }
}
