// *****************************************************************************//
// 版    权 : 深圳市高科润电子有限公司所有(2030)
// 文件名称 : GCE_MCU_Type_Vx.h
// 功能描述 : 芯片属性配置
// 作    者 : 曾海更
// 创建日期 : 2021.6.30
// 版    本 : V1
// 变更记录 : V1/曾海更/2021.6.30
//            1.首次创建
//            V2/xxx/2021.6.30
//            1.优化xxx
//            2.新增xxx
//******************************************************************************//

//******************************************************************************//
//                                 Includes
//******************************************************************************//

//******************************************************************************//
//                                 macro definitions
//******************************************************************************//
#ifndef _GCE_MCU_TYPE_VX_H_
#define _GCE_MCU_TYPE_VX_H_

// ---<< 内核 >>---
#define _CORE_C51 0          // 8051内核变量有区分内部和外部
#define _CORE_OTHER 1        // 其他内核
#define _CORE_TYPE _CORE_C51 // 内核选择,由封装MCU标准化的人来填写

// ---<< 大小端 >>---
#define LITTLE_ENDIAD 0            // 小端模式
#define BIG_ENDIAD 1               // 大端模式
#define MCU_RAM_TYPE LITTLE_ENDIAD // 大小端选择,由封装MCU标准化的人来填写

#endif
//******************************* End of File (H) ******************************
